{"sections":{"heading":{"type":"image-with-text-overlay","settings":{"image":"shopify:\/\/shop_images\/68_3eb41c7e-139f-4558-ac16-3d6f9f036651.jpg","mobile_image":"shopify:\/\/shop_images\/32.png","height":"fixed","height_desktop":400,"height_mobile":300,"image_link":"","subheading":"","title":"Customer Help","heading_max_width":800,"title_size":52,"title_size_mobile":46,"use_h1":false,"text":"<p>If talking to a real-life human is more your thing, you can reach our Customer Happiness Team via email  or phone (below).<\/p>","enlarge_text":true,"button_label_1":"","button_url_1":"","button_label_2":"","button_url_2":"","text_alignment":"center center","full_width":true,"mobile_overlay_under":false,"overlay_style":"shadow"}},"main":{"type":"faq-header","settings":{"title":"FAQ","use_h1":false,"text":"","show_search":true,"show_index":true,"index_heading":"How can we help?"}},"faq-content-1":{"type":"collapsible-tabs","blocks":{"question-1":{"type":"question","settings":{"title":"Do you have a physical shop?","answer":"<p>We are primarily an online store; however, we do have a Studio in Dubai Investment Park 1 that we open <strong>Monday to Sunday <\/strong>between <strong>10Am - 5Pm<\/strong> for clients who wish to visit us.<\/p>"}},"6f7bad9b-e76d-4949-8924-3bc85e2bfc41":{"type":"question","settings":{"title":"Where is your location?","answer":"<p>Our Studio is in Dubai Investment Park 1. You can <a href=\"https:\/\/goo.gl\/maps\/UdS55eQ7Pq12Vots9\" target=\"_blank\" title=\"The Loom Collection Studio Location\">click here for our location pin.<\/a><\/p>"}},"83c22d28-ee82-4294-8923-d2ef53d8af55":{"type":"question","settings":{"title":"When can I visit?","answer":"<p>Every day, Monday to Sunday between 10Am - 5 Pm.<\/p>"}},"2eee1ea8-c957-4880-8ab3-741e6c185c0e":{"type":"question","settings":{"title":"Do you keep all products on display?","answer":"<p>Space permitting, we seek to display as many pieces as possible. However, if you have a specific product or color that you wish to see please get in touch prior to make sure arrangements are done for your items. <\/p>"}},"17a91ec9-8bf7-40ac-9992-d41432248e29":{"type":"question","settings":{"title":"Can I order in the studio?","answer":"<p>Yes of course. Our team will be more than happy to assit and guide you to select the best sizes, configurations and items to suit your individual lifestyle.<\/p>"}}},"block_order":["question-1","6f7bad9b-e76d-4949-8924-3bc85e2bfc41","83c22d28-ee82-4294-8923-d2ef53d8af55","2eee1ea8-c957-4880-8ab3-741e6c185c0e","17a91ec9-8bf7-40ac-9992-d41432248e29"],"settings":{"title":"Visit our studio"}},"1663397559434dab06":{"type":"collapsible-tabs","blocks":{"16633975594f4a5396-0":{"type":"question","settings":{"title":"When will my order be processed?","answer":"<p>Once you place your order, our team starts processing it immediately. Most orders take about 24-48 hrs to be prepared and shipped out.<\/p><p>We do not ship on Sundays.<\/p>"}},"16633975594f4a5396-1":{"type":"question","settings":{"title":"Can I place an order over the phone?","answer":"<p>Absolutely. Please call <a href=\"tel:+971585416898\" target=\"_blank\" title=\"tel:+971585416898\">+971 58 541 6898<\/a> and we will assist. <\/p>"}},"5a7ee285-91ca-47ed-9aed-b7d3ba2384cb":{"type":"question","settings":{"title":"Can I cancel my order?","answer":"<p>While we wish we could, once an order is placed, all of our gears are set in motion and we are unable to cancel it at this time. We hope to have a cancellation window one day in the future.<\/p><p>Should the item(s) not work out, make sure to exchange for a preferred style of a similar value. Not all items may be exchanged. Items that qualify for exchanges are listed below.<\/p><p>As a reminder, domestic and international transport fee is charged separately. This may, however, be deducted from your initial order value. <\/p>"}},"b5a775c9-352f-46a7-b772-8cbc978ef42e":{"type":"question","settings":{"title":"Can I add something to my order once it is placed?","answer":"<p>We completely get it, we sometimes forget too! You can, of course, add items to your order.<\/p><p>Give us a call (before your order is shipped) and we can place a second order for you and do our best to combine the two orders so you get them at the same time. <\/p><p>Call us Monday- Saturday 8Am-5Pm <a href=\"tel:+971585416898\" title=\"tel:+971585416898\">+971 58 541 6898.<\/a><\/p>"}}},"block_order":["16633975594f4a5396-0","16633975594f4a5396-1","5a7ee285-91ca-47ed-9aed-b7d3ba2384cb","b5a775c9-352f-46a7-b772-8cbc978ef42e"],"settings":{"title":"Ordering"}},"166339782604e3395d":{"type":"collapsible-tabs","blocks":{"bf95677d-78bf-4eb9-919a-3b01db86e963":{"type":"question","settings":{"title":"Is my shipping free of charge?","answer":"<p>If your order totals 500aed or more, and you are located in Dubai, Abu-Dhabi or Sharjah <span style=\"text-decoration:underline\">city limits only,<\/span> you qualify for free delivery.<\/p><p>For all other areas as well as areas outside of city limits,(e.g. Al Ain, Western region, Liwa, etc.) we charge a nomimal delivery fee. <\/p><p>All orders less than 500aed carry a nominal charge as well.<br\/><br\/>International deliveries have custom shipping charges depending on the product dimesnions, weight, packaging and delivery location.<\/p>"}},"ed2cb399-742c-49f9-a8cc-f2935dc53273":{"type":"question","settings":{"title":"Is assembly included in the price?","answer":"<p><strong>For UAE customers,<\/strong> yes, assembly as well as debris removal is included in our standard service.<\/p><p>Please note delivery typically is scheduled for one delivery window only, meaning our team cannot deliver and then return at a later stage for installation. Delivery and installation must happen at the same time.<br\/><br\/><strong>International deliveries are curbside only, and assembly service is not included.<\/strong><\/p>"}},"336287ab-a8cb-49dd-a1ea-40ab271e5bc0":{"type":"question","settings":{"title":"When shall I expect my order?","answer":"<p>Our general timeline is 2 business days for Dubai and up to 6 business days for other emirates in the U.A.E. <\/p><p>International deliveries have their own shipping timelines, please refer to your tracking number.<\/p><p>Please expect delays during sales or holidays.<\/p>"}},"16633978262cbd71af-0":{"type":"question","settings":{"title":"What if my items are on pre-order?","answer":"<p>If marked on pre-order, each product has it's own delivery timeline. We endeavour to make the lead times visible under each product description. <\/p><p>Orders with multiple items may have more than one lead time with varying arrival dates. <\/p>"}},"403f5e2b-0505-4fd4-bab0-431508be02e4":{"type":"question","settings":{"title":"Can I choose a later date for delivery?","answer":"<p>Yes, of course. In case you have a preffered delivery date and time, please choose it on the checkout calendar. We will do our best to deliver at your own convienience. <\/p>"}},"16633978262cbd71af-1":{"type":"question","settings":{"title":"What is white-glove delivery?","answer":"<p>White glove service is available in the U.A.E and includes room of choice, unpacking, minor assembly and garbage removal. Our team do not hang art or install lighting fixtures. Additional charges may apply for rural locations, buildings or or any other complex deliveries. White Glove delivery typically is scheduled for one delivery window only, meaning our team cannot deliver and then return at a later stage for installation, delivery and installation must happen at the same time. <\/p><p>Oversized and heavy items are not guaranteed beyond main floor entry for liability reasons. <br\/><br\/><strong>International deliveries are curbside only, and assembly service is not included.<\/strong><\/p>"}},"df8f9d39-4cc3-44b7-b947-3b2316684da5":{"type":"question","settings":{"title":"How to prepare for delivery?","answer":"<p>Please double check weight and measurements prior to ordering. <\/p><p>Please make sure all walkways and the area in which you wish to place the item are clear and ready for the delivery. Service lifts and move-in permits, if required, must be arranged in advance by the client.<\/p><p>We ask that you inspect all items prior to the delivery teams departure.<br\/><br\/><strong>International deliveries are curbside only, and assembly service is not included. Please make sure that appropriate assistance is booked at the time of delivery.<\/strong><\/p>"}}},"block_order":["bf95677d-78bf-4eb9-919a-3b01db86e963","ed2cb399-742c-49f9-a8cc-f2935dc53273","336287ab-a8cb-49dd-a1ea-40ab271e5bc0","16633978262cbd71af-0","403f5e2b-0505-4fd4-bab0-431508be02e4","16633978262cbd71af-1","df8f9d39-4cc3-44b7-b947-3b2316684da5"],"settings":{"title":"Delivery"}},"1664630982f2afe71f":{"type":"collapsible-tabs","blocks":{"166463098244f284f5-0":{"type":"question","settings":{"title":"How does local pick up work?","answer":"<p>We offer free same day collection from our Dubai studio. Simply call our team 4 hours in advance with your order number and we will be able to bring the item forward for your collection. <\/p><p>Please note this service is not available on Sundays.<br\/><br\/>Additionally, it is important to note that all sales are final for items collected from our studio or warehouse. <\/p>"}},"166463098244f284f5-1":{"type":"question","settings":{"title":"Does it fit in your car?","answer":"<p>Please make sure you have enough space to accomate the pick up. Our furniture comes packed in carton boxes and the rugs are rolled on their shorter side (cannot be folded).<\/p><p>If you need assistance in estimating you can always get in touch with our team at <a href=\"tel:+971585416898\" target=\"_blank\" title=\"tel:+971585416898\">+971 58 541 6898.<\/a><\/p>"}}},"block_order":["166463098244f284f5-0","166463098244f284f5-1"],"settings":{"title":"Click & Collect"}},"faq-content-2":{"type":"collapsible-tabs","blocks":{"para-1":{"type":"content","settings":{"content":"<p>We use all major carriers, and local courier partners. You’ll be asked to select a delivery method during checkout.<\/p>"}},"question-1":{"type":"question","settings":{"title":"What is the shipping policy?","answer":"<p>Once your order is placed, you will receive a confirmation email letting you know that our fulfillment team has received your order. Once your order is fulfilled, you will receive an email notification with your tracking information. <\/p><p><strong>Shipping fees are non-refundable in case of exchanges or returns.<\/strong><\/p>"}},"question-2":{"type":"question","settings":{"title":"Do you ship overseas?","answer":"<p>We help our clients with all the steps required for international shipments however our pricing does not reflect shipping outside of the U.A.E.<\/p><p>In order to determine the price please contact our team and mention the items you are interested in as the final cost will depend on the size, weight, and value of the goods to be shipped.<\/p>"}},"066e0fff-469f-498a-9e01-f194431c7086":{"type":"question","settings":{"title":"Can I exchange an item?","answer":"<p>Items can be exchanged if you request it before or at the time of delivery. Our delivery team can help you to re-pack and take back the item for replacement with another one.<\/p><p>However, once signed and accepted by the receiving person, we are unable to exchange it so please make sure to check your items thoroughly during delivery.<\/p><p>As a reminder, if eligible for exchange, a transport and restocking fee of not more than 15% of the value of the order might apply unless you have an active order waiting to be delivered. In that case, The Loom Collection will waive the transport fee.<\/p><p>If your item is eligible, you can request an exchange with available items from The Loom Collection shop.<\/p><p><strong>If your item is marked as final sale or custom order or is a special order, it is not eligible for exchange.<\/strong><\/p>"}},"1c93d798-33a1-495b-b7a1-2d0415dc4f03":{"type":"question","settings":{"title":"Can I return an item?","answer":"<p>While we wish could, once an order is placed, all of our gears are set in motion and we are unable to refund it. <\/p><p>Furthermore, if your order has been delivered, installed, signed and accepted by the receiving person, the item is non-exchangeable. In case of any doubts please read the product description and measure your space even if you believe an items fits.<\/p><p>We ask that you inspect all items prior to the delivery teams departure.<\/p>"}},"f0176af2-e632-45d8-b4cf-42822a922a6b":{"type":"question","settings":{"title":"What if the item is defective?","answer":"<p>Defects and damages are subject to inspection and approval and need to be reported within the first 24hrs of receiving the item.<\/p><p>Please note natural materials including wood, marble, travertine and concrete terrazzo have variations and their imperfections are not considered defects. As foreign wood adapts to our climate, it can shift size and\/or cause cracking. This again is not necessarily a defect of the product, but a beautiful reminder of its organic nature.<\/p>"}},"146d13d3-0719-402b-b8a1-a1bb53fdf66c":{"type":"question","settings":{"title":"Is my item eligible for an exchange?","answer":"<p>Once we receive an exchange request, our team will inspect the condition of the returned package before approving or rejecting an exchange. The following items are not eligible for returns, exchange, or refunds (unless faulty or not matching their description):<\/p><p>- Products that have been opened, assembled and in good condition at the time of delivery. <\/p><p>- Products that have exceeded 24hrs since delivery.<\/p><p>- Products without original packaging or labels.<\/p><p>- Products that are not in their original condition.<\/p><p>- Products that have been opened or unsealed (unless the package was opened for inspection)<\/p><p>- Products that have been used or damaged or are not in the original condition they were delivered in.<\/p><p>- Any product purchased during a sale that does not carry any defects or was sold under the ‘as is’ category.<\/p><p>- Products that have been damaged due to misuse or show signs of wear and tear despite still being within the warranty period.<\/p>"}},"cf73c50b-4336-4b5b-9cd4-3291756b136f":{"type":"question","settings":{"title":"Are delivery charges refundable?","answer":"<p>Please note that transport charges, custom fees, and taxes, if any that are incurred at the time of the purchase, are non-refundable.<\/p>"}}},"block_order":["para-1","question-1","question-2","066e0fff-469f-498a-9e01-f194431c7086","1c93d798-33a1-495b-b7a1-2d0415dc4f03","f0176af2-e632-45d8-b4cf-42822a922a6b","146d13d3-0719-402b-b8a1-a1bb53fdf66c","cf73c50b-4336-4b5b-9cd4-3291756b136f"],"settings":{"title":"Returns & Exchanges"}},"contact":{"type":"rich-text","blocks":{"icon":{"type":"icon","settings":{"icon":"chat_bubble"}},"heading":{"type":"heading","settings":{"title":"Get in touch","use_h1":false}},"text":{"type":"text","settings":{"text":"<p>Have questions about your order, or a general enquiry?<\/p>","enlarge_text":true}},"button":{"type":"button","settings":{"button_label":"Contact us","button_link":"shopify:\/\/pages\/contact-us","button_style":"primary"}}},"block_order":["icon","heading","text","button"],"settings":{"height":"medium","text_alignment":"center","full_width":true,"use_alt_bg":false}}},"order":["heading","main","faq-content-1","1663397559434dab06","166339782604e3395d","1664630982f2afe71f","faq-content-2","contact"]}