{"sections":{"main":{"type":"main-page","settings":{"full_width":true}},"1663391468eb004e70":{"type":"image-with-text-overlay","disabled":true,"settings":{"image":"shopify:\/\/shop_images\/68_3eb41c7e-139f-4558-ac16-3d6f9f036651.jpg","mobile_image":"shopify:\/\/shop_images\/32.png","height":"adapt","height_desktop":600,"height_mobile":460,"image_link":"","subheading":"","title":"Customer Help","title_size":84,"title_size_mobile":46,"use_h1":false,"text":"<p>If talking to a real-life person is more your thing, you can reach our Customer Happiness Team via email (below).<\/p>","enlarge_text":true,"button_label_1":"","button_url_1":"","button_label_2":"","button_url_2":"","text_alignment":"center center","full_width":false,"mobile_overlay_under":false,"overlay_style":"full image-overlay--bg-shadow"}},"16627922031bf45537":{"type":"faq-header","disabled":true,"settings":{"title":"FAQ","use_h1":true,"text":"<p>We might have already answered your question. Use the search bar to find what you are looking for.<\/p>","show_search":true,"show_index":true,"index_heading":"How can we help?"}},"16627885616a42631e":{"type":"collapsible-tabs","disabled":true,"blocks":{"16627885613981fd0a-0":{"type":"question","settings":{"title":"Do you have a physical shop?","answer":"<p>We are primarily an online store; however, we do have a Studio in Dubai Investment Park 1 that we open Monday to Saturday between 10Am - 5Pm for clients who wish to visit us.<\/p>"}},"16627885613981fd0a-1":{"type":"question","settings":{"title":"Where is your location?","answer":"<p>Our Studio is in Dubai Investment Park 1. You can <a href=\"https:\/\/goo.gl\/maps\/UdS55eQ7Pq12Vots9\" target=\"_blank\" title=\"The Loom Collection Studio Location\">click here for our location<\/a><\/p>"}},"2678abdf-8149-4d7a-86c5-39053e764b76":{"type":"question","settings":{"title":"When can I visit?","answer":"<p>Monday to Saturday between 1oAm - 5 Pm. We are closed on Sundays<\/p>"}},"2754a93d-312f-49be-9d57-bcad0953f461":{"type":"question","settings":{"title":"Do you have all the products on display?","answer":"<p>Space permitting, we seek to display as many pieces as possible. However, if you have a specific product or color that you wish to see please get in touch prior to make sure arrangements are done for your items. <\/p>"}}},"block_order":["16627885613981fd0a-0","16627885613981fd0a-1","2678abdf-8149-4d7a-86c5-39053e764b76","2754a93d-312f-49be-9d57-bcad0953f461"],"settings":{"title":"Visit our studio"}},"1661197351d01a76d4":{"type":"collapsible-tabs","disabled":true,"blocks":{"98b22ad9-88d7-43d9-a8d9-56e5b5fecc3c":{"type":"question","settings":{"title":"Shall I order online or in the studio?","answer":"<p>Our website is our main method of displaying and selling products, however we also have a physical store.<\/p><p>First time buyers, if you've never visited our store, we encourage you to come and see the products and speak to one of our team members if you have any doubts. <\/p><p>You can also reach us via phone at <a href=\"tel:+971585416898\" target=\"_blank\" title=\"tel:+971585416898\">+971 58 541 6898<\/a> or via email at <a href=\"mailto:info@theloomcollection.com\" target=\"_blank\" title=\"mailto:info@theloomcollection.com\">info@theloomcollection.com<\/a> if you need close up images, videos, sizing, etc. We will be happy to assist in making your online purchase seamless.<\/p>"}},"ad8a68a1-3d4d-4d14-8af8-93be355a1384":{"type":"question","settings":{"title":"When will my order be processed?","answer":"<p>Once you place your order, our team starts processing it immediately. Most orders take about 24-48 hrs to be prepared and shipped out.<\/p><p>We do not ship on Sundays.<\/p>"}},"ef0b214f-c016-49c6-a1d3-afc81a782098":{"type":"question","settings":{"title":"Can I place an order over the phone?","answer":"<p>Absolutely. Please call <a href=\"tel:+971585416898\" target=\"_blank\" title=\"tel:+971585416898\">+971 58 541 6898<\/a> and we will assist.<\/p>"}},"16611973511baf010a-0":{"type":"question","settings":{"title":"How long until I get my order?","answer":"<p>In Dubai, we seek to deliver within a 2 business day period, and in Abu-Dhabi and other emirates within 6 business days when your items are in stock, not on pre-order. <\/p>"}},"16611973511baf010a-1":{"type":"question","settings":{"title":"Do you customize furniture?","answer":"<p>Our furniture is usually ready-made and packed in boxes for quick delivery. We do offer designers and architects the possibility of choosing fabrics from our ranges and altering sizes of our rugs, however, please note the lead time in such cases is a minimum of 10-12 weeks. <\/p>"}}},"block_order":["98b22ad9-88d7-43d9-a8d9-56e5b5fecc3c","ad8a68a1-3d4d-4d14-8af8-93be355a1384","ef0b214f-c016-49c6-a1d3-afc81a782098","16611973511baf010a-0","16611973511baf010a-1"],"settings":{"title":"Ordering"}},"16627886155ebf7754":{"type":"collapsible-tabs","disabled":true,"blocks":{"16627886155f26ca4f-0":{"type":"question","settings":{"title":"How long until I get my order?","answer":"<p>In Dubai, we seek to deliver within a  2 business day period, and in Abu-Dhabi and other emirates within 6 business days when your items are in stock, not on pre-order. <\/p>"}},"16627886155f26ca4f-1":{"type":"question","settings":{"title":"What if my items are on pre-order?","answer":"<p>Please read the product description for an estimated arrival delivery date.<br\/>Like any business; and despite our best efforts to meet the dates we provide, sometimes events and circumstances conspire against us.<\/p><p>Please feel free to <a href=\"\/pages\/contact-us\" target=\"_blank\" title=\"Contact us:\">keep in touch<\/a> with The Loom Collection team regarding your Pre-order.<\/p>"}},"d4a4c028-f07d-4a8d-a9f0-b4915d218d64":{"type":"question","settings":{"title":"What if my furniture is custom made?","answer":"<p>Each custom product will have specific shipping lead times. The lead time in such cases is a minimum of 10-12 weeks. Orders with multiple items may also have different arrival dates.<\/p>"}},"296b169d-1390-4397-ad3d-1a66c0cb9a89":{"type":"question","settings":{"title":"What do I need to know before delivery?","answer":"<p>Please double check weight and measurements prior to ordering.<\/p><p>Please make sure all walkways and the area in which you wish to place the item are clear and ready for the delivery. Service lifts and move-in permits, if required, must be arranged in advance by the client.<\/p><p>We ask that you inspect all items prior to the delivery teams departure.<\/p>"}}},"block_order":["16627886155f26ca4f-0","16627886155f26ca4f-1","d4a4c028-f07d-4a8d-a9f0-b4915d218d64","296b169d-1390-4397-ad3d-1a66c0cb9a89"],"settings":{"title":"Delivery"}},"1662788645a8b76c63":{"type":"collapsible-tabs","disabled":true,"blocks":{"166278864568596c9d-1":{"type":"question","settings":{"title":"Will it suit my space?","answer":"<p>To get our best advice, you are welcome to visit <a href=\"https:\/\/goo.gl\/maps\/UdS55eQ7Pq12Vots9\" target=\"_blank\" title=\"The Loom Collection Studio Location\">our studio<\/a> to see the products before purchase. You can also read the detailed product descriptions, read prior customers' feedback and <a href=\"https:\/\/theloomcollection.com\/pages\/contact-us\">call or email us<\/a> for more information. <\/p><p>Efforts are made to ensure you get an accurate picture and description of the products on our website so you can make an informed decision. We are more than happy to assist with additional pictures, videos, and information in case you have any doubts. Our team will be happy to assist online by providing videos or close-ups from our studio of the details you might want to see.<\/p>"}},"166278864568596c9d-0":{"type":"question","settings":{"title":"What is the return policy?","answer":"<p>If your order has been delivered, installed, signed or accepted by the receiving person, the item is non-refundable. In case of any doubts please read the product description and measure your space even if you might believe an items fits.<\/p><p>We ask that you inspect all items prior to the delivery teams departure.<\/p>"}},"00f2dd47-6bcd-4639-abb0-3b883a435c1c":{"type":"question","settings":{"title":"Which items are not eligible for returns and exchanges?","answer":"<p>The following products are not eligible for returns, exchange, or refunds (unless delivered faulty or not matching their description): <\/p><p>- Products that have exceeded 24 hrs since delivery <\/p><p>- Products that are not in their original condition <\/p><p>- Products that have been assembled in good condition at the time of delivery or installed, used, or altered<\/p><p>- Products that have been opened or unsealed<\/p><p>- Products without original packaging or label<\/p><p>- Products that have been used or damaged or are not in the original condition they were delivered in<\/p><p>- Products that fall under specific categories such as pillows, mattresses, sheets, comforters, duvet covers, memory foam products, towels, and bathrobes for hygiene reasons.<\/p><p>- Any product purchased as part of a sale that does not carry any defects or was sold under the \"as is\" category<\/p><p>- Products that have been damaged due to misuse or show signs of wear and tear despite still being within the warranty period<\/p>"}},"4bae6a10-4565-428c-8e92-cc5e40c27655":{"type":"question","settings":{"title":"How long does it take for a refund to be issued?","answer":"<p>Refunds can take up to 7 working days from the date when the products have been received back by The Loom Collection.<\/p><p>You can expect an email confirmation with your refund details as soon as it is confirmed & issued. However, please note the exact time taken for the refund amount to reflect on your account can vary depending on your bank.<\/p>"}},"f810de0d-be4b-4174-9813-23a7c3e1b6ed":{"type":"question","settings":{"title":"Are delivery charges, transport fees and custom duties refundable?","answer":"<p>Transport and shipping charges, customs fees, and taxes, if any that are incurred at the time of the purchase, are non-refundable. <\/p>"}},"3096bd76-7f97-47ed-a37a-393c4fed53c3":{"type":"question","settings":{"title":"How do I exchange an item that is eligible?","answer":"<p>If your item is eligible, you can request an exchange before or during the delivery time with available items from The Loom Collection shop. <\/p><p>However please note the delivery charges, as well as the restocking fee of not more than 15%, will be charged unless you have an active order waiting to be delivered. In that case, The Loom Collection will waive the transport fee. <\/p><p><strong>If your item is marked as FINAL SALE or CUSTOM ORDER or is a Special Order, it is not eligible for exchange.<\/strong><\/p>"}},"82d35908-bdc2-4fe9-a054-f6211908ca82":{"type":"question","settings":{"title":"Can I exchange an item?","answer":"<p>Items can be exchanged if you request it before or at the time of delivery. Our delivery team can help you to re-pack and take back the item for replacement with another one.<\/p><p>However, once signed and accepted by the receiving person, we are unable to exchange it so please make sure to check your items thoroughly during delivery.<\/p><p>As a reminder, if eligible for exchange, a transport and restocking fee of not more than 15% of the value of the order might apply unless you have an active order waiting to be delivered. In that case, The Loom Collection will waive the transport fee.<\/p><p>If your item is eligible, you can request an exchange with available items from The Loom Collection shop.<\/p><p><strong>If your item is marked as final sale or custom order or is a special order, it is not eligible for exchange.<\/strong><\/p>"}}},"block_order":["166278864568596c9d-1","166278864568596c9d-0","00f2dd47-6bcd-4639-abb0-3b883a435c1c","4bae6a10-4565-428c-8e92-cc5e40c27655","f810de0d-be4b-4174-9813-23a7c3e1b6ed","3096bd76-7f97-47ed-a37a-393c4fed53c3","82d35908-bdc2-4fe9-a054-f6211908ca82"],"settings":{"title":"Returns & Exchanges"}},"16627886883ff7ae85":{"type":"collapsible-tabs","disabled":true,"blocks":{"1662788688a8035bae-0":{"type":"question","settings":{"title":"Who designs the furniture?","answer":"<p>Our furniture is designed in collaboration with renowned furniture design houses from Denmark, Australia, and New Zealand. <\/p>"}},"1662788688a8035bae-1":{"type":"question","settings":{"title":"How do you choose what materials to use?","answer":"<p>Each piece we create is the product of years of designing, sourcing, and producing with the highest-quality materials and with like-minded production partners. We thoroughly research and vet our raw materials to make sure they meet our standards, are good for you, and are better for the environment. In addition to thinking about the impact on people and the environment, we consider factors like availability, preferred fiber content, water, and energy input, and GHG emissions.<\/p><p>Act natural. We also use mostly natural materials, which break down better and are less of a pollutant than the synthetic fibers that are found in oceans and water supplies.<\/p>"}},"59414577-840e-4f70-bb4e-d2381ea449c7":{"type":"question","settings":{"title":"Where are your products made?","answer":"<p>Most of our products are made in Vietnam, however, we also source products made in Australia, India, China, Belgium and Nepal.<\/p><p>We source and manufacture our furniture all over the world depending on where we can find the highest quality materials and excellent factories that can produce furniture to the standards our customers expect. <\/p><p>We partner with world-class manufacturers and brands that are committed to fair and equitable practices. The more we grow, and as our manufacturing quantities increase, this will continue to be a priority for us. When developing a product, we choose countries that are best-in-class at the desired raw materials and quality, over less expensive labor. <\/p>"}},"301e3c98-7291-47be-be4b-085074ce8915":{"type":"question","settings":{"title":"What are you doing to be more sustainable?","answer":"<p>Our sustainability goals are ambitious and long-term. These goals are designed to innovate and better how we design and manufacture, which means that we thoughtfully consider and care about the materials we source, the production methods we use, and how we minimize waste. <\/p><p>In addition to selecting only FSC-certified wood and partnering with the Care & Fair organization, we are also doing what we can by minimizing production quantities with demand-oriented ordering to minimize unnecessary waste and production. <\/p><p>We are on a journey of progress and as we continue to grow and evolve as a business, we are committed to sharing with you, the actions being taken towards positive change to care for the planet and its people.<\/p><p>To us, being sustainable is about responsible and ethical choices and doing our best to do what’s right for our employees, workers, our customers and the world around us. <\/p>"}}},"block_order":["1662788688a8035bae-0","1662788688a8035bae-1","59414577-840e-4f70-bb4e-d2381ea449c7","301e3c98-7291-47be-be4b-085074ce8915"],"settings":{"title":"Sustainability"}},"166339514218e7d40b":{"type":"rich-text","disabled":true,"blocks":{"c1f16751-8e0d-4668-8380-69967c9ae14c":{"type":"icon","settings":{"icon":"chat_bubble"}},"166339514276512889-0":{"type":"heading","settings":{"title":"Get in touch","use_h1":false}},"166339514276512889-1":{"type":"text","settings":{"text":"<p>Have questions about your order, or a general enquiry?<\/p>","enlarge_text":true}},"ff8e6d64-9396-4ae5-b5a8-70d5119c743a":{"type":"button","settings":{"button_label":"Contact us","button_link":"shopify:\/\/pages\/contact-us","button_style":"primary"}}},"block_order":["c1f16751-8e0d-4668-8380-69967c9ae14c","166339514276512889-0","166339514276512889-1","ff8e6d64-9396-4ae5-b5a8-70d5119c743a"],"settings":{"height":"medium","text_alignment":"center","full_width":false,"use_alt_bg":false}}},"order":["main","1663391468eb004e70","16627922031bf45537","16627885616a42631e","1661197351d01a76d4","16627886155ebf7754","1662788645a8b76c63","16627886883ff7ae85","166339514218e7d40b"]}